{"format": "layers-model", "generatedBy": "keras v3.12.0", "convertedBy": "TensorFlow.js Converter v4.17.0", "modelTopology": {"keras_version": "3.12.0", "backend": "tensorflow", "model_config": {"class_name": "EmotionCRNN", "config": {"name": "emotion_crnn", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "input_size": 256, "hidden_size": 256, "num_layers": 2, "num_classes": 7, "dropout": 0.3, "cnn_channels": 64}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "bidirectional/forward_lstm/lstm_cell/kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional/forward_lstm/lstm_cell/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional/forward_lstm/lstm_cell/bias", "shape": [1024], "dtype": "float32"}, {"name": "bidirectional/backward_lstm/lstm_cell/kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional/backward_lstm/lstm_cell/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional/backward_lstm/lstm_cell/bias", "shape": [1024], "dtype": "float32"}, {"name": "bidirectional_1/forward_lstm_1/lstm_cell/kernel", "shape": [512, 1024], "dtype": "float32"}, {"name": "bidirectional_1/forward_lstm_1/lstm_cell/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_1/forward_lstm_1/lstm_cell/bias", "shape": [1024], "dtype": "float32"}, {"name": "bidirectional_1/backward_lstm_1/lstm_cell/kernel", "shape": [512, 1024], "dtype": "float32"}, {"name": "bidirectional_1/backward_lstm_1/lstm_cell/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_1/backward_lstm_1/lstm_cell/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense/kernel", "shape": [512, 256], "dtype": "float32"}, {"name": "dense/bias", "shape": [256], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [256, 1], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [1], "dtype": "float32"}, {"name": "sequential/conv1d/kernel", "shape": [3, 256, 64], "dtype": "float32"}, {"name": "sequential/conv1d/bias", "shape": [64], "dtype": "float32"}, {"name": "sequential/batch_normalization/gamma", "shape": [64], "dtype": "float32"}, {"name": "sequential/batch_normalization/beta", "shape": [64], "dtype": "float32"}, {"name": "sequential/conv1d_1/kernel", "shape": [3, 64, 128], "dtype": "float32"}, {"name": "sequential/conv1d_1/bias", "shape": [128], "dtype": "float32"}, {"name": "sequential/batch_normalization_1/gamma", "shape": [128], "dtype": "float32"}, {"name": "sequential/batch_normalization_1/beta", "shape": [128], "dtype": "float32"}, {"name": "sequential/conv1d_2/kernel", "shape": [3, 128, 256], "dtype": "float32"}, {"name": "sequential/conv1d_2/bias", "shape": [256], "dtype": "float32"}, {"name": "sequential/batch_normalization_2/gamma", "shape": [256], "dtype": "float32"}, {"name": "sequential/batch_normalization_2/beta", "shape": [256], "dtype": "float32"}, {"name": "sequential/batch_normalization/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "sequential/batch_normalization/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "sequential/batch_normalization_1/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "sequential/batch_normalization_1/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "sequential/batch_normalization_2/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "sequential/batch_normalization_2/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "sequential_1/dense_2/kernel", "shape": [512, 256], "dtype": "float32"}, {"name": "sequential_1/dense_2/bias", "shape": [256], "dtype": "float32"}, {"name": "sequential_1/dense_3/kernel", "shape": [256, 7], "dtype": "float32"}, {"name": "sequential_1/dense_3/bias", "shape": [7], "dtype": "float32"}]}]}
