{
  "format": "layers-model",
  "generatedBy": "keras v3.12.0",
  "convertedBy": "TensorFlow.js Converter v4.17.0",
  "modelTopology": {
    "keras_version": "3.12.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 256, 200],
              "dtype": "float32",
              "sparse": false,
              "name": "input_1"
            }
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d",
              "trainable": true,
              "filters": 64,
              "kernel_size": [3],
              "strides": [1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            }
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d",
              "trainable": true,
              "pool_size": [2],
              "padding": "valid",
              "strides": [2]
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout",
              "trainable": true,
              "rate": 0.15,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_1",
              "trainable": true,
              "filters": 128,
              "kernel_size": [3],
              "strides": [1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_1",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            }
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d_1",
              "trainable": true,
              "pool_size": [2],
              "padding": "valid",
              "strides": [2]
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_1",
              "trainable": true,
              "rate": 0.15,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Conv1D",
            "config": {
              "name": "conv1d_2",
              "trainable": true,
              "filters": 256,
              "kernel_size": [3],
              "strides": [1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_2",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            }
          },
          {
            "class_name": "MaxPooling1D",
            "config": {
              "name": "max_pooling1d_2",
              "trainable": true,
              "pool_size": [2],
              "padding": "valid",
              "strides": [2]
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_2",
              "trainable": true,
              "rate": 0.3,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Bidirectional",
            "config": {
              "name": "bidirectional",
              "trainable": true,
              "layer": {
                "class_name": "LSTM",
                "config": {
                  "name": "lstm",
                  "trainable": true,
                  "units": 256,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "recurrent_initializer": {
                    "class_name": "Orthogonal",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.3,
                  "recurrent_dropout": 0.0,
                  "implementation": 2,
                  "return_sequences": true,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "time_major": false
                }
              },
              "merge_mode": "concat"
            }
          },
          {
            "class_name": "Bidirectional",
            "config": {
              "name": "bidirectional_1",
              "trainable": true,
              "layer": {
                "class_name": "LSTM",
                "config": {
                  "name": "lstm_1",
                  "trainable": true,
                  "units": 256,
                  "activation": "tanh",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "recurrent_initializer": {
                    "class_name": "Orthogonal",
                    "config": {
                      "seed": null
                    }
                  },
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.3,
                  "recurrent_dropout": 0.0,
                  "implementation": 2,
                  "return_sequences": true,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "time_major": false
                }
              },
              "merge_mode": "concat"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "units": 512,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_3",
              "trainable": true,
              "rate": 0.3,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "units": 256,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "units": 7,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of3.bin",
        "group1-shard2of3.bin",
        "group1-shard3of3.bin"
      ],
      "weights": [
        {
          "name": "conv1d/kernel",
          "shape": [3, 256, 64],
          "dtype": "float32"
        },
        {
          "name": "conv1d/bias",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/gamma",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/beta",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "conv1d_1/kernel",
          "shape": [3, 64, 128],
          "dtype": "float32"
        },
        {
          "name": "conv1d_1/bias",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/gamma",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/beta",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "conv1d_2/kernel",
          "shape": [3, 128, 256],
          "dtype": "float32"
        },
        {
          "name": "conv1d_2/bias",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/gamma",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/beta",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "bidirectional/forward_lstm/lstm_cell/kernel",
          "shape": [256, 1024],
          "dtype": "float32"
        },
        {
          "name": "bidirectional/forward_lstm/lstm_cell/recurrent_kernel",
          "shape": [256, 1024],
          "dtype": "float32"
        },
        {
          "name": "bidirectional/forward_lstm/lstm_cell/bias",
          "shape": [1024],
          "dtype": "float32"
        },
        {
          "name": "bidirectional/backward_lstm/lstm_cell/kernel",
          "shape": [256, 1024],
          "dtype": "float32"
        },
        {
          "name": "bidirectional/backward_lstm/lstm_cell/recurrent_kernel",
          "shape": [256, 1024],
          "dtype": "float32"
        },
        {
          "name": "bidirectional/backward_lstm/lstm_cell/bias",
          "shape": [1024],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_1/forward_lstm_1/lstm_cell/kernel",
          "shape": [512, 1024],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_1/forward_lstm_1/lstm_cell/recurrent_kernel",
          "shape": [256, 1024],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_1/forward_lstm_1/lstm_cell/bias",
          "shape": [1024],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_1/backward_lstm_1/lstm_cell/kernel",
          "shape": [512, 1024],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_1/backward_lstm_1/lstm_cell/recurrent_kernel",
          "shape": [256, 1024],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_1/backward_lstm_1/lstm_cell/bias",
          "shape": [1024],
          "dtype": "float32"
        },
        {
          "name": "dense/kernel",
          "shape": [512, 512],
          "dtype": "float32"
        },
        {
          "name": "dense/bias",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [512, 256],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [256, 7],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [7],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/moving_mean",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization/moving_variance",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_mean",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_1/moving_variance",
          "shape": [128],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_mean",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_variance",
          "shape": [256],
          "dtype": "float32"
        }
      ]
    }
  ]
}